backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
---
  def authorize_request
    token = cookies[:access_token]

    Rails.logger.info "Cookieからアクセストークンを受け取り、認証処理を実行" if Rails.env.development?

    if token.nil?
      Rails.logger.warn "Cookieにアクセストークンが見つかりません"
      render json: { error: '認証されていません。ログインしてください。' }, status: :unauthorized
      return
    end

    decoded_token = AuthService.decode_token(token)

    # decode_tokenn が nil または想定外の型である場合
    if decoded_token.nil?
      Rails.logger.warn "トークンのデコードに失敗しました (nil)"
      render json: { error: 'トークンの解析に失敗しました。トークンが不正です。'}, status: :unauthorized
      return
    end

    # decoce_token が Hash であることを確認
    unless decoded_token.is_a?(Hash)
      Rails.logger.warn "無効なトークン: #{decoded_token.inspect}"
      render json: { error: '無効なトークンです。トークンの形式が正しくありません。'}, status: :unauthorized
      return
    end

    # トークンの有効期限が切れているか確認

    user_id = decoded_token['user_id']
    @current_user = User.find_by(id: user_id)