backend/app/controllers/AuthController.rb

  def verify
    header = request.headers['Authorization']
    puts "Authorization header:", header.inspect
    token = header.split(' ').last if header
    if token
      begin
        decoded = decode_token(token)
        puts "Decoded token:", decoded
        user = User.find(decoded['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]