backend/app/controllers/dreams_controller.rb

SELECT "dreams".* FROM "dreams"
INSERT INTO "dreams" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "旅行の夢"], ["description", "旅行に行く夢を見ました。"], ["user_id", 2], ["created_at", "2024-09-03 20:11:26.886206"], ["updated_at", "2024-09-03 20:11:26.886206"]]
INSERT INTO "dreams" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "虫の夢"], ["description", "虫が出てくる夢を見ました。"], ["user_id", 35], ["created_at", "2024-09-23 20:22:41.730924"], ["updated_at", "2024-09-23 20:22:41.730924"]]
---
  def create
    Rails.logger.info "DreamsController#create called"
    Rails.logger.info "Params: #{params.inspect}"

    # 音声ファイルがあるかどうかで処理を分岐
    if params[:dream][:audio].present?
      @dream = current_user.dreams.build(title: "音声入力された夢 #{Time.current.strftime('%Y-%m-%d %H:%M')}")
      @dream.audio.attach(params[:dream][:audio])
    else
      @dream = current_user.dreams.build(dream_params)
    end

    if @dream.save

UPDATE "dreams" SET "description" = $1, "updated_at" = $2 WHERE "dreams"."id" = $3  [["description", "イム様に古代兵器で消される夢を見ました。"], ["updated_at", "2024-09-24 20:41:42.601555"], ["id", 12]]
---
  def update
    # 音声ファイルが添付された更新リクエストの場合
    if params[:dream][:audio].present?
      @dream.audio.attach(params[:dream][:audio])
      # ここでジョブを起動することも可能
    end

    if @dream.update(dream_params)

DELETE FROM "dreams" WHERE "dreams"."id" = $1  [["id", 10]]
---
  def destroy
    if @dream.destroy

SELECT "dreams".* FROM "dreams" WHERE "dreams"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_dream_and_authorize_user
      @dream = Dream.find_by(id: params[:id])