backend/app/controllers/trial_users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "username", "trial_user") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    Rails.logger.debug "TrialUsersController#create called" if Rails.env.development?
    result = nil
    error_response = nil

    ApplicationRecord.transaction do
      begin
        result = AuthService.create_trial_user(
          params[:trial_user],
          user_agent: request.user_agent, ip_address: request.remote_ip
        )